Revit 2016 API
FabricationPart.ServiceId Property
 The fabrication part service identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016 Subscription Release
Syntax
C#
public int ServiceId { get; }
Visual Basic
Public ReadOnly Property ServiceId As Integer
	Get
Visual C++
public:
property int ServiceId {
	int get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace